###################################################################

# Created by write_sdc on Sun Aug  2 11:48:08 2015

###################################################################
set sdc_version 1.9

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current mA
set_max_fanout 6 [current_design]
set_max_area 0
set_load -pin_load 1 [get_ports {o_finish_operation_o}]
set_load -pin_load 1 [get_ports {o_last_pic_out_o}]
set_load -pin_load 1 [get_ports {o_last_col_out_o}]
set_load -pin_load 1 [get_ports {o_color_out_o[1]}]
set_load -pin_load 1 [get_ports {o_color_out_o[0]}]
set_load -pin_load 1 [get_ports {o_valid_out_o}]
set_load -pin_load 1 [get_ports {o_pixel_out_o[7]}]
set_load -pin_load 1 [get_ports {o_pixel_out_o[6]}]
set_load -pin_load 1 [get_ports {o_pixel_out_o[5]}]
set_load -pin_load 1 [get_ports {o_pixel_out_o[4]}]
set_load -pin_load 1 [get_ports {o_pixel_out_o[3]}]
set_load -pin_load 1 [get_ports {o_pixel_out_o[2]}]
set_load -pin_load 1 [get_ports {o_pixel_out_o[1]}]
set_load -pin_load 1 [get_ports {o_pixel_out_o[0]}]
create_clock [get_ports i_clk_i]  -period 10  -waveform {0 5}
set_clock_latency 0.5  [get_clocks i_clk_i]
set_clock_uncertainty 0.1  [get_clocks i_clk_i]
set_input_delay -clock i_clk_i  -max 1  [get_ports i_clk_i]
set_input_delay -clock i_clk_i  -max 1  [get_ports i_rst_n_i]
set_input_delay -clock i_clk_i  -max 1  [get_ports {i_pixel_in_i[7]}]
set_input_delay -clock i_clk_i  -max 1  [get_ports {i_pixel_in_i[6]}]
set_input_delay -clock i_clk_i  -max 1  [get_ports {i_pixel_in_i[5]}]
set_input_delay -clock i_clk_i  -max 1  [get_ports {i_pixel_in_i[4]}]
set_input_delay -clock i_clk_i  -max 1  [get_ports {i_pixel_in_i[3]}]
set_input_delay -clock i_clk_i  -max 1  [get_ports {i_pixel_in_i[2]}]
set_input_delay -clock i_clk_i  -max 1  [get_ports {i_pixel_in_i[1]}]
set_input_delay -clock i_clk_i  -max 1  [get_ports {i_pixel_in_i[0]}]
set_input_delay -clock i_clk_i  -max 1  [get_ports {i_color_in_i[1]}]
set_input_delay -clock i_clk_i  -max 1  [get_ports {i_color_in_i[0]}]
set_input_delay -clock i_clk_i  -max 1  [get_ports {i_valid_in_i}]
set_input_delay -clock i_clk_i  -max 1  [get_ports {i_last_col_in_i}]
set_input_delay -clock i_clk_i  -max 1  [get_ports {i_last_pic_in_i}]
set_input_delay -clock i_clk_i  -max 1  [get_ports {i_mode_in_i[2]}]
set_input_delay -clock i_clk_i  -max 1  [get_ports {i_mode_in_i[1]}]
set_input_delay -clock i_clk_i  -max 1  [get_ports {i_mode_in_i[0]}]
set_output_delay -clock i_clk_i  -min 0.5  [get_ports {o_pixel_out_o[7]}]
set_output_delay -clock i_clk_i  -min 0.5  [get_ports {o_pixel_out_o[6]}]
set_output_delay -clock i_clk_i  -min 0.5  [get_ports {o_pixel_out_o[5]}]
set_output_delay -clock i_clk_i  -min 0.5  [get_ports {o_pixel_out_o[4]}]
set_output_delay -clock i_clk_i  -min 0.5  [get_ports {o_pixel_out_o[3]}]
set_output_delay -clock i_clk_i  -min 0.5  [get_ports {o_pixel_out_o[2]}]
set_output_delay -clock i_clk_i  -min 0.5  [get_ports {o_pixel_out_o[1]}]
set_output_delay -clock i_clk_i  -min 0.5  [get_ports {o_pixel_out_o[0]}]
set_output_delay -clock i_clk_i  -min 0.5  [get_ports {o_color_out_o[1]}]
set_output_delay -clock i_clk_i  -min 0.5  [get_ports {o_color_out_o[0]}]
set_output_delay -clock i_clk_i  -min 0.5  [get_ports {o_valid_out_o}]
set_output_delay -clock i_clk_i  -min 0.5  [get_ports {o_last_col_out_o}]
set_output_delay -clock i_clk_i  -min 0.5  [get_ports {o_last_pic_out_o}]
set_output_delay -clock i_clk_i  -min 0.5  [get_ports {o_finish_operation_o}]
set_drive 1  [get_ports i_clk_i]          
set_drive 1  [get_ports i_rst_n_i]        
set_drive 1  [get_ports {i_pixel_in_i[7]}]
set_drive 1  [get_ports {i_pixel_in_i[6]}]
set_drive 1  [get_ports {i_pixel_in_i[5]}]
set_drive 1  [get_ports {i_pixel_in_i[4]}]
set_drive 1  [get_ports {i_pixel_in_i[3]}]
set_drive 1  [get_ports {i_pixel_in_i[2]}]
set_drive 1  [get_ports {i_pixel_in_i[1]}]
set_drive 1  [get_ports {i_pixel_in_i[0]}]
set_drive 1  [get_ports {i_color_in_i[1]}]
set_drive 1  [get_ports {i_color_in_i[0]}]
set_drive 1  [get_ports {i_valid_in_i}]   
set_drive 1  [get_ports {i_last_col_in_i}]
set_drive 1  [get_ports {i_last_pic_in_i}]
set_drive 1  [get_ports {i_mode_in_i[2]}] 
set_drive 1  [get_ports {i_mode_in_i[1]}] 
set_drive 1  [get_ports {i_mode_in_i[0]}] 
